{
  "places": [
    {
      "types": [
        "pub",
        "bar",
        "clothing_store",
        "store",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "47-48 Temple Bar, Dublin 2, D02 N725, Ireland",
      "displayName": {
        "text": "The Temple Bar Pub",
        "languageCode": "en"
      },
      "reviews": "Best Irish Pub atmosphere Ive been too in ages! \n This location is well renowned around the world for all the smiles, happy vibes it procures but especially because of all the famous people who have been here as visitors or to perform. \n The food is also very good and the staff really nice, polite and efficient. \n Decorated like a true Irish pub with great live music always playing! \n FYI: There is an ATM machine in the basement beside the washrooms if you ever need real cash money. \n GOOD JOB TL;DR: The Original Temple Bar Pub in Dublin is a lively spot with great service, live music, and a fun crowd. A must-visit on any pub crawl! \n The Original Temple Bar Pub was a fantastic stop on our afternoon Dublin pub crawl. The atmosphere was lively, even on a Tuesday afternoon, with great live music adding to the experience. \n Our server, Dylan, was excellent, attentive, friendly, and even gave us great recommendations for our next stops. We also had a great chat with Ian K, which made the visit even more enjoyable. \n If you're looking for a classic Dublin pub experience with great service and entertainment, this is a must-visit! We stopped in because the outside of the building was decorated amazingly for Christmas, and we wanted a warm drink. The inside was also decorated well, the service was excellent,  and the food and drinks were great.  We ordered the cheese board and a hot chocolate with a shot of Bailey's Irish Cream. \n The cheese board came with 5 types of cheese, grapes, apples,  nuts, crackers,  and bread. It was also served with honey and another tomato-based sauce.  It was the perfect midday snack. \n The service was quick, and the live music was entertaining.  This is one of my new favorite places. The Temple Bar Pub is a decent enough Irish pub with a lively atmosphere and great live music. Its undoubtedly one of the most famous spots in Dublin, and the energy inside reflects that. The musicians were talented, and the overall vibe was enjoyable. \n That said, its extremely touristy which is expected given its location. If you're looking for an authentic, local pub experience, this probably isnt the place. The biggest downside? The price. Paying 12 for a pint of Guinness felt excessive, even by Dublin standards. \n Worth a visit for the experience, but be prepared to pay a premium for it. Visiting the Temple Bar was an unforgettable experience! The atmosphere was vibrant and lively, with people from all over the world coming together to enjoy the iconic spot. The live music added an incredible charm, showcasing talented local artists playing everything from traditional Irish folk to upbeat contemporary tunes. \n The bar offers an extensive selection of drinks almost overwhelming in the best way! We stuck to local beers, which didnt disappoint. Each sip was a true taste of Irelands brewing craft. While it was a bit pricey (as expected for such a famous spot), its absolutely worth it for the experience alone. \n Fun fact: The Temple Bar has been serving visitors for over 170 years, and despite its name, its not actually a temple! The name comes from Sir William Temple, who owned land in the area in the 17th century. Another fascinating tidbit Temple Bar is home to one of Irelands largest whiskey collections, so if youre a fan of whiskey, its a must-try. \n Did you know that the surrounding Temple Bar district is considered the cultural quarter of Dublin? Its filled with galleries, street performers, and quirky shops, making it the perfect area to explore before or after your visit to the bar. \n All in all, its a must-visit spot for anyone wanting to soak up Dublins unique character, music, and local flavors!"
    },
    {
      "types": [
        "pub",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "20 Lower Bridge St, Usher's Quay, Dublin, D08 WC64, Ireland",
      "displayName": {
        "text": "The Brazen Head",
        "languageCode": "en"
      },
      "reviews": "I could not have enjoyed this spot more. Getting word from our local guides that this is the oldest pub in Ireland, we knew we had to try it. Upon entry, you definitely get the feel of authentic Ireland. We first had dinner here and I can confidently state that our group all very much enjoyed their food. True to form with the rest of our Ireland dining experience, the portion sizes are generous and the flavors are hearty and delightful. Myself I enjoyed the cod.\n\nI hope you get to experience live music here. The bar space was a bit snug, fairly full when we arrived, but I felt this came to add to the charm and made the experience even more enjoyable. The night of our visit, a trio of musicians played classic Irish songs in the corner of the room, with no distance between them and the patrons. I could feel the heart and passion they played with that brought a tear to my eyes as I enjoyed a Guinness. Great historic building.  Staff was friendly. We sat at the back bar, which still serves food. As opposed to the very back room, which is the upstairs bar. Our bartender was knowledgeable and helpful with food choices. I had the wings and chips, while my wife had the bacon and cabbage.  Both we decent. Loved looking at all the patches and currency on the wall.  I recommend gong here if you're in the area.  This wasn't the best meal we've had in Dublin, but it was good. Went to The Brazen Head on my recent trip to Dublin and it was a great experience. Its about a 10 minute walk from Temple Bar so although you will see tourists, it doesnt give off too much of a tourist trap. Went after dinner so I didnt get to try the food, but the drinks are good, ambiance is incredible and the live music is a wonderful way to immerse yourself in the local culture. Easily spent several hours listening to the Rye River Band! Worth visiting the oldest pub in Ireland when you are in Dublin! Very cozy ambience that even impressed our 14 year old! Food was decent, and service was fine. We went for lunch on a Sunday, and did not have to wait long for a table. Food arrived fairly quickly as well. Would definitely recommend while in Dublin. This bar is a bit touristy but its super neat to be in such an old establishment. I was a little confused about how to get seated, we saw some spots at the bar open and asked to sit there and they said it was fine to do so. We each ordered a Guinness and then the Bangers and Mash and Beef Stew. Both were delicious but I preferred the stew over the bangers and mash. The service was fine and it was crowded when we arrived but then the crowd thinned out. Overall, we are happy we went and had a good time."
    },
    {
      "types": [
        "pub",
        "bar",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "12A Abbey Street Lower, North City, Dublin 1, D01 AY67, Ireland",
      "displayName": {
        "text": "The Silver Penny - JD Wetherspoon",
        "languageCode": "en"
      },
      "reviews": "Not bad. Overall atmosphere 5, food 4. Food was hot, delivered quickly. No cranberry sauce was added to the Christmas menu. And the chicken strips in Katsu curried were not very fresh. But in general, for such a large amount, it is very good. You can eat and drink cheaply. Waiters and bartenders served quickly. They were always friendly. New Year's atmosphere, Christmas tree, lights. Decent food for the price, especially in the middle of Dublin city. Great place to stop for early lunch but extremely packed on weekend dinner. Quite a huge restaurant and every corner is taken up for seats. There's a whisky bar upstairs. The coffee was weak when I was there, maybe machine needs a clean. Beautiful place to eat and drink. Lovely staff\nVery reasonable priced.\nEnjoyed everything at the at this establishment. Will definitely be a regular customer. The worst Wetherspoons in the world. Food took ages to come & the fish & chips was dry and had been reheated several times before we got it. Drinks came after the meal. Normally you know what youre going to get in a Spoons. But not here. This is awful. What you see is what you get. I would say this is a pretty average pub. Cheap and cheerful pints and drinks. Food is pretty alright, never have had issues of any sort with food or drinks here. Being able to order directly to the table Via the app is definitely a perk! Place is usually always busy and loud so if you're looking for just a quiet drink go elsewhere. Would also like to add that there is a smoking garden and there is a kids food menu available."
    },
    {
      "types": [
        "pub",
        "bar",
        "event_venue",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "77 King St N, Smithfield, Dublin, D07 TP22, Ireland",
      "displayName": {
        "text": "The Cobblestone",
        "languageCode": "en"
      },
      "reviews": "You come here for the music, hands down. The pints are decently priced. There is no food but the music is an absolute gem. You won't get the same experience twice as it is always a different group every day. We came here multiple nights and it felt very appropriate that it was our last visit before leaving Ireland.\nA true gem of Dublin that has the true Irish experience! This place!   Great pub off the tourist route.   Traditional Irish music while having a cold pint.    Bar tenders are attentive and friendly.      Recommended by a local and he nailed it.   Get there early if you want a seat. If you love Irish music, this pub is a must-visit! The atmosphere is fantastic warm, lively, and full of energy. The live music adds an authentic touch, making it a great spot for a night out. It can get quite busy, but that only adds to the charm. A perfect place to enjoy a pint and some great tunes! This place was recommended by a tour guide (Kieran from Original Dublin free tours). The place was crowded but had a great atmosphere. We were lucky to find seats near the musicians. There were several musicians playing different instruments including violins, flutes and accordions. As some left others took their place and despite being unrehearsed they were very in sync. It was the first time we listened to Irish traditional music live and we enjoyed it very much. Great pub for live music and drinks. Wonderful staff. Steven Doody took good care of us and even taught us a bit of Irish history during our visit."
    },
    {
      "types": [
        "pub",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "15 Merrion Row, Dublin, D02 PF50, Ireland",
      "displayName": {
        "text": "O'Donoghues Bar",
        "languageCode": "en"
      },
      "reviews": "I always make sure to stop by O'Donoghues when I'm in the area. The live Irish music is fantastic and really adds to the authentic atmosphere of the pub. It's a great spot for enjoying traditional tunes. The pub itself, located off the alley, is quite small and can feel a bit cramped, but it has a cozy charm to it. They do have servers, which is a nice touch considering the size of the place. Overall, it's a great place to soak in the atmosphere and enjoy some live music, even if its a bit tight on space. Great place for a pint or a coffee. Lots of people  to meet if you want. Unfortunately it has changed is is no longer like the old days. Still one of the best pubs in lreland. The pub is great and always good craic. Unfortunately they have an old bar man who absolutely ruins the vibe. Absolutely miserable person. I see from other reviews it's a common complaint. I'll probably never darken the door again because there's plenty more pubs in Dublin just like it without a sour auld bar man ruining it Amazing outdoor seating area to watch rugby loads of screens barman was so fast. Great service doesn't serve food. But did see people order food in frm a nearby restaurant. Best pour of Guinness that Ive found in my travels so far. Hugh is not only hilarious but he pours the perfect pint. I will definitely be back the next time I find myself in Dublin."
    },
    {
      "types": [
        "pub",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "39-40 Fenian St, Dublin 2, D02 KD51, Ireland",
      "displayName": {
        "text": "The Ginger Man",
        "languageCode": "en"
      },
      "reviews": "This pub was decorated in full Christmas spirit when we visited.  According to their write-up.  the decorations went up starting in November, and there is a lot of it.\nThe place is a classic Irish pub, very crowded but still welcoming and fun.  It took some effort by one of the servers to find us a place to sit but he managed upstairs.  There is also a basement, 1st floor.  All very crowded.  You are most likely going to share a table with others but I considered this a bonus.  It gives you a chance to talk and mingle with other patrons.\nTheir food was very good.  We had a  Caesar salad, burger and shepherd's pie.  All very tasty.\nNo idea how parking is.  Since it is around a pretty decent neighborhood I suspect you can find parking on the streets. Enjoyed the BEEF & GUINNESS PIE made with Irish Hereford beef, root vegetables, baked in a rich Guinness gravy; pastry crust, served with champ mashed potato. It's a bit of a modern take on the classic pie dish. Think of it more like a deconstructed version, the pastry is only on top, rich beef stew. Loaded with mashed potatoes on the side that you can dip in to the beef gravy. The bread with butter is shockingly good as well. Plenty filling for 18. Absolutely packed, which I'm not surprised about considering Christmas is round the corner, and it's like stepping into Santa's Workshop itself in there.\n\nWe went around 1630 and were lucky enough to catch a couple leaving and give us their table. This was very very lucky as it was absolutely packed in there, with there being no where else to stand or sit.\nDespite this, service at the bar was quick and drinks on the edge of being expensive (this central London prices) for two spirt mixers.\nPints of Guinness were being poured in bulk to speed up service.\n\nGreat atmosphere, if you love Christmas, this place is a must! Went there the last weekend and its very nice inside. Full of Xmas decorations. I went there at 15.00pm when they opened and thats a pity you can get only evening menu and not the morning menu such as toast or sandwich. 15.00 pm is still lunch time and evening menu should start from 17.00/18.00pm. Its true all that Christmas video and decor that you see , very cheerful atmosphere, lucky to had opportunity to seat without waiting so all was wonderfully, drinks and snacks"
    },
    {
      "types": [
        "pub",
        "hotel",
        "bar",
        "lodging",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "1, 5 Camden Street Upper, Saint Kevin's, Dublin, D02 K854, Ireland",
      "displayName": {
        "text": "Keavan's Port - JD Wetherspoon",
        "languageCode": "en"
      },
      "reviews": "It was my first time using a wetherspoons hotel, so I was a little unsure of what to expect. Staff were friendly and professional, the room was immaculate and the price of the stay was very reasonable. I was very happily surprised after spending all day out to find that housekeeping had left fresh towels in the room without me asking. I would definitely recommend and will definitely be returning Great experience with fantastic food! The wings were a highlight, and the sharer plate is definitely worth trying. David, our waiter, was excellent always smiling and attentive. The atmosphere was vibrant, with clean facilities. The only thing missing was some music to complete the vibe! Myself, husband & baby were staying nearby & dropped in for lunch 16th & 17th Dec. The staff were friendly, & really helpful trying to get us somewhere suitable to sit with our baby. Specifically the fair hair lady on Wednesday (who kept putting logs on the fire) she was exceptional in every way! The building itself is incredible. There seems to be never ending areas to explore! The food was good - for the price you really can't go wrong. We will back. A good place to hangout with friends be it trios or octos. The drinks and food are pocket friendly even Students can visit without any worries. The staff tries their level best to serve on time even though the number of orders are massive. The overall vibes are great. Unfortunately,  I had a disappointing experience at this restaurant with a friend. The fries were clearly reused, which is unacceptable. They were soggy, cold, and lacked any flavor. It was obvious they had been sitting out for a while and were reheated. It completely ruined my meal. For the price, I expected much better quality and attention to food preparation. I won't be coming back."
    },
    {
      "types": [
        "pub",
        "bar",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "33-34 O Connell st upper, dublin 1 Dublin 1, Rotunda, Dublin 1, D01 E0W2, Ireland",
      "displayName": {
        "text": "Murray's Sports Bar",
        "languageCode": "en"
      },
      "reviews": "Visit as tourist: Great pub/bar to visit in Dublin. Had the chance to have lunch (15:00) and dinner with live music(20:00). Both occasions were great. The Menu is different for lunch and dinner. The live music in the evening was awesome with a very cool band on stage. Food was decent with higher prices in the dinner Menu. I found a slight difference of prices between the Menu during the day compared with the menu offered during the evening. The environment is great and the pub is very big offering 2 levels. Definitely worth visiting this pub is great to see the bar and their whiskey collection. I saw this place and decided to try it. Not bad. Very American. Chicken wings were good. The taco fries were so good. The portion sizes were pretty big so I had enough food for two people. The Strawberry Daiquiri pitcher wasnt strong but it did definitely had a nice flavor. Called in for breakfast and we had the full Irish. Unfortunately when it arrived it was missing two items although they did supply them when asked. The toast was like cardboard, I had poached eggs which were overcooked with hard yolks and my girlfriend's fried eggs were also overcooked. Sausages tasted like cheap mass produced ones and the plates were cold like the food. Staff were pleasant enough but food was substandard The security on the door was more interested in talking  2 a couple his friends from the opposite sex than saying hello, and thank you for coming to new people coming in.\nBut the food was great Really nice and affordable pub in the center of Dublin. It's actually 3 pubs connected by an inner garden, all with their own distinctive atmosphere, which is lovely if you like variety throughout the night. Drinks are affordable and the staff is lovely, I will definitely come back"
    },
    {
      "types": [
        "pub",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "3 Crown Alley, Temple Bar, Dublin, D02 CX67, Ireland",
      "displayName": {
        "text": "The Old Storehouse Bar and Restaurant",
        "languageCode": "en"
      },
      "reviews": "A Must-Visit in Dublin!\n\nThe Old Storehouse Bar & Restaurant is a true Irish gem! The warm atmosphere, friendly staff, and live music make it a fantastic spot to soak in Dublins charm. Their Guinness Casserole is simply outstanding tender beef in a rich, flavorful Guinness gravy, paired perfectly with creamy mashed potatoes.\n\nIf youre looking for great food, great vibes, and a true taste of Ireland, this is the place to be! Cant wait to return! We made a reservation one week in advance to avoid disappointment. The atmosphere was might craic! We ordered butter and garlic bread for sharing, old Irish steak, traditional Guinness and Irish beef casserole as mains, finishing with Baileys cheesecake and Irish coffee. We enjoyed the live music, food, and the overall Irish experience. Great place to enjoy Irish music and some dancing.\nThe food is really delicious but the drinks are even better with this fun Irish pub atmosphere.\nThe place is huge buts gets packed really fast so make sure to do a reservation.\n Staff is so nice and friendly!\n GOOD JOB My team and I were in Dublin for just one night, and The Old Storehouse came highly recommended and wow, it didnt disappoint!\n\nStarters:\nSpicy Buffalo Wings: So good! Tangy, rich, and just the right amount of spice. Perfect with the blue cheese sauce.\n\nFried Breaded Mushrooms: Simple but solid, as always.\n\nGarlic Bread with Cheese: Soft, airy, and loaded with the perfect amount of garlic and cheese.\n\nMains:\nI went with the Guinness and Irish Beef Casserole with soda bread on the side, and honestly, it was the best casserole Ive ever had. The beef was super tender and packed with flavour, and the buttery, fluffy mash took it to the next level. It's absolutely amazing.\n\nThe rest of my team tried the Beer Battered Fish and Chips, Grilled Chicken Burgers, and Irish Cottage Pie, and they loved everything. The only letdown? The Irish Lamb Stew, which was watery and lacked flavour.\n\nDrinks:\nThe Guinness pints? Spot on just as you'd expect in Dublin.\n\nThe vibe in the place was lively and buzzing, which made the experience even better. We sat upstairs, and the service was fantastic our server was super attentive.\n Ill definitely be back the next time Im in Dublin. I highly recommend checking it out! When we entered, the seating was confusing as to wear to go. There was a line up the stairs apparently, but no host stand. The Live music was good. The seafood chowder was flavorful with lots of fish & carrots & the bread was delicious. The strawberry daiquiri is very small but strong. *Service charge is added already"
    },
    {
      "types": [
        "pub",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "139 Baggot Street Lower, Dublin 2, Ireland",
      "displayName": {
        "text": "Toners",
        "languageCode": "en"
      },
      "reviews": "Want to get a feel for a local pub in Dublin - this is your spot.  Pub has a lot of character, huge heated outdoor seating ( Toners Yard). Great place to hang out with friends and a few pints. Toners is a great spot, especially if you're looking for a lovely beer garden to relax in. The bar itself is a bit of a walk, but once you're there, it's worth it. One thing I'd love to see improved is the food situation while they have online menus for a nearby pizza place on the tables, you have to pick up the food yourself, which feels a bit inconvenient. The prices are on the higher side too; I paid 7.80 for a pint of Guinness, which feels a bit steep. That said, it's still a good place overall with a great vibe, especially if you want to enjoy a drink in the beer garden. Great place for a group of friends to have some drinks and catch up. Brilliant atmosphere. Fantastic pub with a big outside space. We went in as a group of 10 and found space easily. Would love to go back Best pint of Guinness in Dublin ...big promise I know, but let's just say Top 5 easily!\n\nMASSIVE garden out the back (see pic) plus lots of nooks and crannies.\n\nNice touch now that you can order the pizza from next door that is absolutely top notch!!"
    },
    {
      "types": [
        "pub",
        "bar",
        "event_venue",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "Stephen Street Lower, Dublin 2, Ireland",
      "displayName": {
        "text": "The Hairy Lemon",
        "languageCode": "en"
      },
      "reviews": "Nice place to grab a beer and have some nice Irish food.\n\nWe cannot book in advanced but they found us a table quite quickly.\n\nThe place is really lovely, the atmosphere is charming and convivial.\n\nThe food was really good, didnt wait for too long to be served. The prices are reasonable.\n\nWe took the fish and chips, quite feeling, not too greasy and the fish was very savory. The fries and wedges were nice too.\n\nPerfect place to have an Irish experience is Dublin You don't get any more iconic than The Hairy Lemon! It has the good vibes and the cosy atmosphere you want from a pub in Dublin, and then some. It's always fun to pop in for a pint (of which there are plenty) or a bite to eat.\n\nGiven its fame, it will almost always be very busy, but that's part of the fun, isn't it? Aside from pints, there's also a good menu consisting of solid pub food and Irish classics - here you get your Beef and Guinness stew, your fish and chips and burgers.\n\nThe stars of the show are undoubtedly the chicken wings! I had people visiting from abroad and they can't leave Dublin without having a generous serving of Hairy Lemon wings.\n\nAdd live music, the occasional sports event and of course the unmistakable yellow facade and you've got maybe the pub to end all pubs. Crowded, small, noisy. All things a foreigner expects from a local Dublin establishment. The wait staff was accommodating and polite, the food was passable, and the drinks were amazing. We stumbled across the Hairy Lemon whilst wandering around Dublin. So we stopped for a quick lunchtime drink before making our way back to the airport.\nA quirky place with friendly staff. The food delivered  to others in the bar looked and smelt great.\nIt was quite unexpected to find somewhere with such a large list of zero alcohol drinks. Big thumbs up for that. Amazing food, very friendly staff, brilliant atmosphere, and the location was absolutely perfect for us, just a 5 minute walk at most. The breakfast is one of the best I've ever had and we also went for lunch, my wife had the coddle and I had the stew, both were amazing, but having tried my wife's coddle... WOW. She said her grandma used to make it for her, and this was just as good, huge compliment.\n\nI highly recommend you try this place, and personally, I would even travel to eat here!"
    },
    {
      "types": [
        "bar_and_grill",
        "pub",
        "night_club",
        "bar",
        "event_venue",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "35-37 Essex St E, Temple Bar, Dublin 2, D02 Y891, Ireland",
      "displayName": {
        "text": "Bad Bobs Temple Bar",
        "languageCode": "en"
      },
      "reviews": "I came here in my first few days of being on exchange in Dublin as a student from Australia exactly a year ago, in January of 2024. I felt instantly at home here. The live music, the lighting, the people...it never fails to make you want to drop everything and just dance your heart out. I'll never forget this place, I still think about it even a year later. It's an absolute must for anyone visiting Dublin. Amazing pub with a fantastic atmosphere! The food was delicious and they had many great drinks on tap, with very agreeable pricing too (I HIGHLY recommend the chicken wings)!\n\nLoved the aesthetic or Irish bar meets hunting lodge and the live music was fun to listen to as well to really complete the feeling of a fun night out. Nicest pub in the city center that I have got to experience so far. Great vibes, a very cozy atmosphere. There is great Live music, the service is nice and drinks are priced fairly! The Guinness pulled beef sliders were amazing.  Very flavorful and great start to the meal.  The chicken fingers and chicken burger were both good.  Service was your average dont bother me and Ill bring your food when its ready, common theme in Dublin.  Thought maybe stopping at one of the places in the touristy area it would be different.  I was wrong. Found this pub during Dublin's exploration on the 30th of December. Got back on the 31st with friends because the atmosphere was too awesome. 5 floors of drinks, music and fun. Unforgettable. Highly recommended. Best way to find friends and fun \n Pro tip: use the toilets on the underground floor, the clerk there is the best."
    },
    {
      "types": [
        "pub",
        "bar",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "1 Dame Ct, Dublin, D02 TW84, Ireland",
      "displayName": {
        "text": "The Stags Head",
        "languageCode": "en"
      },
      "reviews": "Very good food and atmosphere! We went in cause of the good reviews and we were not disappointed ! Portions of food are big, I can recommend Irish Cottage Pie ! If I ever come back to Dublin, thats where I go ! What an amazing little pub on the edge of the Temple Bar district! \n We wandered in here after reading about this pub on some vacation blogs online, and we were not disappointed! \n Its a beautiful pub, with carved wooden bar and ceilings, and plenty of ambiance provided by the warm textures, the relaxed environment, and the super friendly and informative staff. Our waiter took the time to explain the differences in his (and his colleagues) favorite Irish beers and whiskeys, and that helped us a lot to have an amazing experience. They have a huge selection of spirits and beers, and ample seating available.\nWe really liked the prices! The prices for drinks were much lower (at least 25 to 30 percent) than pubs that we had visited that were less than two blocks away.\nAlso, for those who prefer a quieter and more relaxed space, there is a small snug bar that is adjacent to the main bar.\n We will definitely keep returning to this pub (we saw many locals there) and we will definitely recommend it to others! One of my favourite pubs in Dublin, the atmosphere lends itself to laughter, openness, and frivolity. However, I thought the stew needs a bit of improvement, though, the meat was a bit dry, for the price it should really be better. Is not hard to nail an Irish stew. The Stags Head in Dublin is a pure delight! Their cheese toastie isnt just a sandwich its a divine experience thatll make you yell, Oh my God! after the first bite. Pair it with their lunch special, which is both comforting and surprisingly affordable your taste buds will do a happy jig! And dont skip their Irish whiskey selection its smoother than an Irish ballad on a misty night. Full stars, full hearts, and full stomachs. Go once, and youll become a regular faster than you can say. A must if you are doing a pub crowl in Dublin. It has a nice atmosphere that tracks you back in time. We tried two pintes ( Irish ale and hop house).\nCostumer service was good but we had to get closer to the bar to get our drinks."
    },
    {
      "types": [
        "pub",
        "hotel",
        "bar",
        "lodging",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "27 Leeson Street Lower, Saint Kevin's, Dublin 2, Ireland",
      "displayName": {
        "text": "House Dublin",
        "languageCode": "en"
      },
      "reviews": "Had a great time here yesterday! The food was delicious, the atmosphere was warm and inviting, and the service was top-notch. Definitely a place Id recommend and would love to visit again! I booked the junior suite and it was very spacious and modern for great value. I definitely would put it up there with some 4 star rooms Ive stayed in. I have previously stayed in the smaller rooms, but considering the difference in price is not much, I would definitely book the junior suite. Staff were great too, very welcoming in the hotel and bar. I stayed at this hotel from Sunday - Wednesday and there were no parties downstairs so it was quiet. The room/bathroom was very clean and the staff are really kind and helpful. The location of the hotel is perfect to visit Dublin center. The restaurant and bar are beautifully decorated and the food was excellent as well. They made us feel welcome, seen and at home, I would definitely recommend staying here. Excellent staff. They warned me that the place gets loud on Saturday nights because it transforms into a big night club until 3am.  It was manageable but be prepared and use supplies earplugs. Love the ambiance. My husband and I were so excited to stay here because of all the reviews we read online regarding the restaurant/bar. Unfortunately, for our entire two night stay, we had zero access to the restaurant as they had private events. We were not informed prior & rushed to the side, ignored and not even told at the time of arrival they would be closed Let alone the confusing and dangerous maze to our room. Once we got to our room, we were given only one pillow each, no notes regarding if we could order food or drinks and every time we attempted calling there was no answer until after their event closed on the second day. Had we known it would have been closed we would have never stayed hopefully in the future they let their guests know ahead of time or offer them a package to offset the limited service.\n Would not recommend unless you call ahead to ensure you had access as Im sure if we had, this review would be entirely different."
    },
    {
      "types": [
        "pub",
        "bar",
        "event_venue",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "81 Talbot St, North City, Dublin, D01 YK51, Ireland",
      "displayName": {
        "text": "The Celt",
        "languageCode": "en"
      },
      "reviews": "A real discovery. This pub was recommended to us and I can say that it is one of the best pubs in Dublin where I have been. When you enter and walk towards the interior, you can see the nice decoration and the great atmosphere in this pub. The waiters are very friendly and pleasant and the food is really good. If you are going to have lunch or dinner with children you should make a booking in advance. The Guinness bread was so good it was the first time I tried it and it was delicious! I also ordered the healthy salad which was full of vegetables and had a delicious dressing. My partner ordered beef stew and it was delicious as well. Great vibe in the place and good prices, fairly cheaper than places closer to the city center. We came here, purely because it was close to our hotel, but we liked the environment and the music! It turned out better than we expected. The food was good, and we had a great time! Absolutely our favorite bar and restaurant when we visited Dublin!  It is very authentic and welcoming. Seems small when you walk-in but has a large room in the back for seating as well. The staff were amazing and helpful. The food was delicious and fresh. We were in Dublin for 3 days and went there 4 times. If we were there again in the future, that would be one of our first stops!  Thanks so much for being a great experience for us in our travels. A busy and loud pub full of life and music. The food was great and came out very quickly even though the place was packed. Stayed for the music. Music starts every night at 9:30 pm. It was fun and everyone sang along to the songs they knew."
    },
    {
      "types": [
        "pub",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "19 Fishamble St, Christchurch Pl, Temple Bar, Dublin 8, D08 PD8W, Ireland",
      "displayName": {
        "text": "Darkey Kelly's",
        "languageCode": "en"
      },
      "reviews": "Great authentic irish pub from the food to the music.\n We were a group of 7 people and everything we ordered to eat was so delicious !\n FYI; They are expecting such a huge crowd on March 17th for St.Patricks day that they do not serve food on this day.\n The atmosphere is very much pub style but with that Irish twist that we all enjoy. So welcoming and heartfelt.\nThe typical Irish music that we all enjoy starts later around 19h00 so arrive around 17h30 if you want a seat.\nThe staff offered us such an amazing service, polite , efficient and catered to all our needs even before we knew that we wanted something else.\nMany thanks to our waiter see you next time!\n \nHighly recommend,\n GOOD JOB Stopped in for dinner.  Got there at 7pm. Place was packed and we were seated at the bar.  I got the burger and my wife got the stew. She loved her dinner.  My burger was dry and not very good.  Bartender weren't very attentive, but they were very busy.  Had to flag them down to get refills. Good live music. Highly recommended! We ordered the lamb and the beef stew, and we really enjoyed both. The food is authentic, and the service was great. The prices are quite reasonable, and the atmosphere makes you feel like a local. This place is awesome. There is live music everyday. And at least when I visited, all the bands were old men playing which for me they have a better music taste than young bands, but thats completely subjective. We also tried fish and chips and they were okay but the vibe of the place is the best.\n\nCorrection from last paragraph: we went twice and tried more food. It was incredible, so highly recommend this place for drinks and food!! Excellent bar on the edge of the Temple Bar area. Live music and a great atmosphere inside. Very friendly staff. Had delicious fish and chips whilst the wife had beef and Guinness stew. Both dishes were brilliant and good portion sizes too."
    },
    {
      "types": [
        "pub",
        "bar",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "9 Anne St S, Dublin, D02 NY88, Ireland",
      "displayName": {
        "text": "Kehoes Pub",
        "languageCode": "en"
      },
      "reviews": "They say Guinness tastes better in Ireland,\nAnd I bet to that, cash in hand\nespecially when the liquid flows from the barrel to the top,\nyour taste buds get surprised, theyll go plop.\n Loved this pub, I have to say,\n Guiness + Taylor Swift makes you want to stay,\n It can get very busy, by the way,\nso when you order, raise you voice to say hey! I was so excited to visit the pub as I am from the Kehoe lineage. The pub is a classic one complete with a snug. We enjoyed our Guinness and the atmosphere. My only disappointment was that I tried to purchase tee shirts to commemorate our visit but the barkeep was completely dismissive. Top class. The staff are so fast and friendly. So lovely to see proper irish staff who can speak proper English.\nLove cozy spot. Obsessed with the Irish decor and photo of Michael Collins! A true gem Guinness tasted surprisingly good one of the best Ive ever had in Ireland! One of the best pubs in Dublin. Professional, old school Irish barmen, great Guinness, atmosphere and manys a great session Ive enjoyed here, hopefully another one today."
    },
    {
      "types": [
        "pub",
        "bar",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "78 Camden Street Lower, Saint Kevin's, Dublin 2, D02 C642, Ireland",
      "displayName": {
        "text": "Devitts Pub",
        "languageCode": "en"
      },
      "reviews": "I had dinner with friends in the cobblestone and it was a fantastic experience! The barman was extremely helpful in getting a table for food (it can fill up very fast) and the waitresses were extremely kind and patient. We ordered the loaded fries and the beef tacos. The food was so big, it was definitely worth the price. I would recommend anyone to eat in Devitts, its a brilliant restaurant! Devittos has a relaxed and pleasant atmosphere, perfect for a fun night out. With games and live music, its a lively spot to enjoy with friends.\nFor dinner, I had the roast of the day, and it was absolutely delicious. I also tried the bars own new beer, After Ours, smooth and a great choice to kick off the night. A fantastic place for drinks, great food, and entertainment! We were there with a couple of lads to watch the Ireland vs NZ rugby game in November. Even though it was quite crowded, theyd let us in by a really kind doorman, he seemed to like argentinian people!\nWe had probably the best pint of Guinness during our stay in Dublin. Strongly recommended. Very nice looking pub, always packed but we got lucky and we found a couple leaving a table.\n\nThe waitress was super helpful and quick, we got food in less than 30 minutes.\nThe burger was very tasty and the pint was simply delicious.\n\nSuper recommended but very busy! Very nice coddle, the best Ive had in Ireland (but not the most expensive). The pea and courgette soup of the day was also nice. They offer Clockwork Velvet stout, which is a very good alternative to Guinness (which I havent seen elsewhere).\nVery friendly staff."
    },
    {
      "types": [
        "pub",
        "bar",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "15 William St S, Dublin 2, D02 H336, Ireland",
      "displayName": {
        "text": "Grogan's",
        "languageCode": "en"
      },
      "reviews": "Great local bar with unique atmosphere!! Fair price on the drinks, specially on Guinness!!\n\nNice neighborhood and less turistic than temple bar with a much better beer vs cost !!\n\nI would recommend this bar to anyone looking for a good experience in Dublin!! We popped in for a quick pint or two following a recommendation from a local. The Guinness is good and reasonably priced. There's no music or TV, it's all about socialising and chatting to others. There isn't enough of that in this day and age.\n\nThe staff are friendly and they enjoy some great banter with each other and their customers. One of the best people watching spots in Dublin located in a beautiful part of town near George's street arcade. Great pints, toasties and friendly efficient service. Beamish, the search of this sacred pint is what pulled us into Grogan's on our first trip to Dublin,  and I can confirm it was sensational. You'll struggle to find a better bar here and we visited a fair few. Straight up atmosphere where the pints and service take centre stage. No pretense, tourists or trying to be anything other than a classic pub where the Guinness (or Beamish for those in the know) and craic take priority. Fantastic looking toasties for those in need of sustenance, though we didn't partic this time. Dublin was ok, but this place is what makes me want to return immediately, just to spend the day with a few Beamish and maybe a toastie. Cool vibe, great staff, tasty toasties. No need to comment on the Guinness or Cider - but there were both delish"
    },
    {
      "types": [
        "pub",
        "bar",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "8 Poolbeg St, Dublin 2, DO2TK71, Ireland",
      "displayName": {
        "text": "Mulligan's",
        "languageCode": "en"
      },
      "reviews": "Cracking pub. Sign behind the bars asks you to not use mobile phones. I did my best to abide by that but couldn't resist a few photos. Was busy on a Tuesday evening in January. Guinness was great and very authentic crowd. Not touristy despite it's good reputation. Great Pub for a very authentic Irish bar experience. Not frequently visited by tourists. Nice spot to grab a refreshing Murphys. It was recommended by an Irish friend and definitely a bar I would visit again. It was my very first time in Dublin and in this pub. I was surprised by the peoples warmth and attention we got from staff. It was around 6 pm and it was not too crowded but there were a few seats available. I had such a great time and the pint of Guinness was very pleasant! It wasnt as expensive as I thought itd be.\n Id definitely recommend this place :) We didn't have any food we just went to get some drinks but we didn't see any menu for food either. Ordered and paid at the bar for drinks and just find wherever you can sit or stand.\nIt's a very wholesome and authentic Irish bar in the feel and apparent! Love the atmosphere As soon as I get off the train from Belfast I try and figure out how soon Im getting to Mulligans. I know a lot of my friends are the same! The standard across every pint is so so high."
    },
    {
      "types": [
        "wine_bar",
        "cafe",
        "brunch_restaurant",
        "bar_and_grill",
        "night_club",
        "bar",
        "event_venue",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "40 Dawson St, Dublin, Ireland",
      "displayName": {
        "text": "Cafe en Seine",
        "languageCode": "en"
      },
      "reviews": "A great evening at Cafe en Seine in Dublin. Very tasty food and a very charming, relaxed waitress who lovingly took care of all my companion's allergy problems. My thanks also go to the kitchen, which was so flexible that it worked out. Beautiful interior, very chic. A great experience and definitely not the last time. Thank you very much! First time visiting, took the family for my birthday brunch. Everything was amazing, food delicious, so stylish and impressive atmosphere, very attentive staff. Top notch! Boys said the burger was one of the best ever. Would highly recommend to try it, kids friendly too. Beautiful and upscale venue, perfect for all-day drinks or a meal. The food is decent but overpriced, and desserts were a bit underwhelming. You come here more for the atmosphere and elegance than the dining experience.\n\nP.S. The birthday complimentary dessert was so small that if thats what youre offering, better not offer one at all. Yesterday was the first time for me to go to Cafe en Seine for dinner and I'm really glad I did!\n\nWe have been there before quite a few times but always for drinks or to join some party (mostly Halloween parties).\n\nThis time we wanted to grab a light meal and check out the vibe.\n\nWe knew cocktails were great and so we started with one. We found very fascinating that the waitress who was serving us recommended a different drink from the one we initially chose staying that people usually ended up preferring that one.\n\nOne of the rare cases where someone in hospitality admits that something they do is not up to their usual standards and cares about customer satisfaction more than some not so useful sense of pride. That deserves kudos.\n\nBoth our mains were rich, tasty, interesting and very, very enjoyable.\n\nWe didn't try more because we knew we would have had a long night ahead of us but we'll definitely go back to try more food!\n\nAfter dinner we checked out the cocktail area. As it was Halloween weekend we were hoping to see plenty of people wearing costumes and dancing but it wasn't the right night for that.\n\nWe were very intrigued to know that instead there was a night called Absolute Alchemy where magical cocktails would have been created. This was our first restaurant on our trip to Dublin and we absolutely loved it! We were able to get one of the last reservations available for the next 2 weeks and had dinner at 9pm. We were greeted and sat immediately and service was wonderful. My partner and I both ordered an espresso martini and it was delicious. We then split the fish and chips for our main entree and it was incredible! For a side, we ordered the Brussel sprouts and roasted carrots and those were both phenomenal. 10/10 highly recommend!"
    },
    {
      "types": [
        "steak_house",
        "wine_bar",
        "seafood_restaurant",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "34 College Green, Dublin 2, D02 C850, Ireland",
      "displayName": {
        "text": "Hawksmoor Dublin",
        "languageCode": "en"
      },
      "reviews": "Came here during their Sunday roast menu with a friend and came away with some mixed feelings.\n\nIn terms of negatives, I thought the service was a bit below average and the staff were somewhat hard to get a hold of. They were friendly but not really attentive. As for the food, my friend got the Sunday roast and said it was nice, while I had the Wellington with the mash and Mac & Cheese.\n\nThe Wellington wasnt what I expected and was more like a pie with mince meat and a ton of mushrooms. Nice crust but overall not that great. The mash and Mac & Cheese I also found quite average, which is really disappointing for the price youre paying.\n\nNow in terms of positives, the venue is stunning, in a beautiful building with really nice decor. The wow factor was there as we walked in. The most redeeming thing for me were the desserts, they were spectacular. The Peanut Butter Louis was so so good, and the ice cream it was paired with was divine. My friend tried the sticky toffee pudding and thought it was also really delicious.\n\nOverall, the meal ended on a positive note but the overall experience just isnt worth the cost in my opinion. Visited Hawksmoor for the lunchtime offer and it was incredible. The building is stunning and the service was fantastic. We both opted for the potted beef as a starter- the accompanying gravy was the best I've ever had. We upgraded to filet tail for main and this was cooked to perfection. For dessert, one had apple pie with custard and the other had sticky toffee sundae. We wanted to visit again during our time in Dublin because it was that good but unfortunately time didn't allow. This is a must do! We visited Hawksmoor for womens day on Saturday after noon and we enjoyed every bit of it. The restaurant is super elegant and the details are lovely. We got seated right away and offered a drink. The menus then came out and we also got a lunch menu which had amazing 2 or 3 course meal for a very good price. The food was super delicious. The service is honestly amazing too , super attentive staff and the atmosphere was super! I would recommend coming here for a date or a family dinner or even lunch. First time visit was great , really enjoyed everything about the restaurant :) The beef dripping chips are something else though , wow. The caramel toffee sunday was 10/10. The pieces of sticky toffee were soooo good , i would definitely recommend  getting that. Had 1kg prime rib steak for 3 people with medium rare cooking. It came uniformly cooked. Atmosphere is spectacular. A lovely afternoon lunch on a beautiful sunny March day. We really wanted to try the Matt burger and the beef dripping chips. On Mondays you can byow with corkage costing a mere 5. We brought along a Chateauneuf du Pape which we had picked up in a Lidl special at Christmas time for 15. The wine complemented the burgers and chips fantastically. The staff were friendly, attentive and efficient. The surroundings are stunning especially with the lovely Cupola in the centre. Worth a trip!"
    },
    {
      "types": [
        "brunch_restaurant",
        "wine_bar",
        "coffee_shop",
        "cafe",
        "breakfast_restaurant",
        "middle_eastern_restaurant",
        "bar",
        "food_store",
        "restaurant",
        "food",
        "store",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "153 Capel St, North City, Dublin, D01 V9V0, Ireland",
      "displayName": {
        "text": "Brother Hubbard (North)",
        "languageCode": "en"
      },
      "reviews": "The absolute best food I've had since going vegan in 2023! It looked colourful, smelt divine, and tasted fabulous!\nIt was quite busy throughout the time that we were there but the staff never looked harassed and happily answered my questions.\nThey have a cookbook that I will be ordering on payday.\nIt has a lovely open, contemporary feel to the place and despite how big it is, due to its layout, it doesn't have that 'canteen' feel that some large restaurants can have.\nThe menus are regularly changed too.\nI most definitely recommend Brother Hubbard if you're ever in Dublin and want some really great food, vegan or otherwise.. The staff were super friendly but unfortunately our wait time for our food was well after others. My wife loved her pulled pork Benedict & our son devoured his cinnamon walnut scroll. Price wise we spent about 70 for a family of 5 but we didnt get the kids actual meals just pastries. Went on a recent visit here for my 40th birthday. What an amazing spot! While I count myself somewhat adventurous with my food options, I wouldn't have had here on my to visit list. And boy, was I missing out. At the time of visiting their was a Middle Eastern food selection on the menu. Every dish was excellent. We went for the sharing plates between our group. All the food options were explained to us, and for each course that came out, we were given  information about it. The staff here were very friendly and welcoming. I would highly recommend this spot. Try something new you might just like it. Solid brunch place, ok prices. Could it have been cheaper? yes? but could it have been more expensive? also yes.\n\nthe staff here is very friendly! super nice and super helpful when it comes to recommendations. the restaurant itself is also cool, cozy, but a bit basic if that makes sense. nothing wrong with that.\n\nthe food, lets start with the good. the cinnamon bun was excellent! perfect level of sweet, and had some extra crunch to it. The juice was also very good, and my party also said the coffee was solid. however i did not enjoy the pulled pork toast as much, as i thought everything was a bit too much, and it made the toast quite soggy, and everything on the plate kind of tasted the same.\n\nbut still a solid brunch spot! recommend. Delicious food with Middle Eastern twist.  Very spacious but tends to get busy at times so booking recommended. Good and friendly service. Nice speciality coffee too. Lots of options for vegans."
    },
    {
      "types": [
        "pub",
        "wine_bar",
        "bar_and_grill",
        "bar",
        "event_venue",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "24-25 Camden Street Upper, Saint Kevin's, Dublin 2, D02 NP22, Ireland",
      "displayName": {
        "text": "The Bleeding Horse",
        "languageCode": "en"
      },
      "reviews": "Food was enjoyable. They had live music, but some songs were better than others. Since it was a seat yourself situation, it could be easy to be overlooked if you take a table tucked away in a corner. We were seated right at the front and had service very quickly. Cool little place, passed by on the bus and wanted to check it out based on the name alone. Server was friendly but we did feel forgotten about a few times, food overall was fairly good but the cauliflower bites were warm at best, they definitely weren't fresh (as in they seemed like they were made and then forgotten about under a heating lamp waiting to be expoed). Drinks were great and atmosphere was really cool. Good service, the team are well organised and efficient. Good selection of beverages. Friendly atmosphere for the rugby. Plenty of screens and places to sit. I would probably go back here next time I'm in Dublin A cool place but gets really crowded at the weekends despite being a large one. I like the big screens everywhere and the drinks display at the entrance - great! Not a cheap one I must say, but not the most expensive. Service seemed to be okay. The design of the pub is really nice! Well, its worth visiting  The bleeding horse was a casual pub just outside Dublins downtown core, it was less touristy and had great vibes and live music! Grabbed drinks here 2 nights of our trip since we loved it so much. Lots of seating on multiple floors, reasonably priced drinks and a nice area! I didnt get any food but they did have a full food menu."
    },
    {
      "types": [
        "wine_bar",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "76 Benburb St, Smithfield, Dublin, D07 X3PN, Ireland",
      "displayName": {
        "text": "Fish Shop",
        "languageCode": "en"
      },
      "reviews": "Small place but reservations needed, saw multiple walk-ins turned away. Menu was straightforward and delicious. Had both a gluten free and regular fish and chips.\n\nWine was great and service was spot on - super friendly and attentive. They were quick to check in and clear things away.\n\nFood was absolutely delicious, crispy and well well cooked batter without overcooking the fish. Will be back. I've searched far and wide for the best fish and chips in Dublin. Going to dozens and dozens of places. Nothing compared to the quality and cuts of fish offered at the Fish Shop. A truly lovely and cozy place. Try everything they have and don't forget to make a reservation! I was told to come here by one of my local friends.\n\nThe place is amazing!\nFish and chips is great. There couple kinds of fish to choose from.\nMussels dish is also tasty.\n\nRecommend to book in advance to avoid disappointment This was spot was at the top of our list for one night we had in Dublin. Make sure you make a reservation. We went in for lunch and they said to check for reservation open that evening and we did. The staff makes you feel right at home. The menu is small and perfect. Everything was prepared simply and delicately that made the fish shine. The scallops and grilled fish of the day were wonderful in addition to the fish and chips of course. Dont skip dessert. It will surprise you. A great little gem in Smithfield! The menu is small, but I think any fish lover will leave happy! To start, we had the dressed crab on toast and croquettes, which were both excellent! For the main, I went for the fish and chips, which is probably the best you'll find in Dublin. They offer an amazing wine menu too! The restaurant is small so I definitely would make a booking. The only downside was the number of times we were told when they needed the table back. We had a reservation and were aware of this, but from the second we sat down until we left, it was mentioned to us 4 times, which felt a bit much. We felt pushed to leave even before our reservation was up. Maybe they've had issues in the past, but I feel once would have been enough, other than this, we really enjoyed our meal!"
    },
    {
      "types": [
        "wine_bar",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "64 William St S, Dublin, D02 XW99, Ireland",
      "displayName": {
        "text": "The Port House",
        "languageCode": "en"
      },
      "reviews": "This place has such a great ambience, I loved the atmosphere of this place too! The food and the service is fantastic.\nThe waitress gave me her recommendations and it was really good. Ive been to this restaurant 3 times and always packed. Im so happy that I have found this lovely restaurant in Dublin. Definitely will go back. The cute place for a date or a girls night out. When we were there 90% or the tables were busy - so I suggest booking. They offer tapas and wine : u can do bottle or per glass. Prices are rather reasonable. The best thing is the staff - very helpful and fun! Would be back I think I ate the best salad I've ever had in my life here. You can taste many different dishes in small portions at once. My favorite system. I really liked their cocktails also. I will go again and again. A very nice food experience. Portion sizes are just right. Pollo croquettes were the nicest and the desserts were excellent too.\nHighly recommend this place. Food was good except for the churros - chocolate too thin and liquidy; wasnt great. Slow cooked duck leg is a great option.\n\nKept getting asked every 2 seconds from the moment we sat at our table for our order, which got quite bothersome.\n\nLighting seems a bit too dim; food looked entirely different color."
    },
    {
      "types": [
        "italian_restaurant",
        "wine_bar",
        "pizza_restaurant",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "74 Dame St, Temple Bar, Dublin, D02 PY80, Ireland",
      "displayName": {
        "text": "Forno 500",
        "languageCode": "en"
      },
      "reviews": "Stopped by Forno 500 for lunch, and wow one of the tastiest meals Ive had in a while! Their bolognese is absolutely next-level, rich, and full of flavor. And lets talk about those roast potatoes...an absolute must-order, no questions asked! Crispy on the outside, soft on the inside, and perfectly seasoned. The whole experience was fantastic, with friendly, attentive staff that made it even better. Cant wait to go back! We went for dinner in a Saturday 5pm (pre-booked). Very cosy atmosphere, good music (not loud), the staff was attentive (a Brazilian waitress super friendly), we got the Early Bird menu, food was impeccable, honest portions, desserts tasty as well.\nI highly recommend - and will be back. Me and my wife were craving pizza so stopped by here after reading a few of the reviews. We shared a pizza, some garlic potatoes and a bottle of wine. The pizza was really tasty and authentic, and more than enough for both of us. The potatoes were awesome, especially with the truffle mayo dip. The service was excellent and the price reasonable. All in all a great little find that we would definitely recommend! Huge friendly welcome from staff on arrival. Straightforward uncomplicated menu and robust fresh Italian cuisine. The rice balls were amazing. Great Pizza and Pasta. Veg Lasagne, Risotto of the day and Aranchini Balls were okayish. Dessert was not good at all."
    },
    {
      "types": [
        "thai_restaurant",
        "wine_bar",
        "vietnamese_restaurant",
        "asian_restaurant",
        "meal_takeaway",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "7 William St S, Dublin 2, D02 CV65, Ireland",
      "displayName": {
        "text": "Saba Restaurant",
        "languageCode": "en"
      },
      "reviews": "Some of the best food I have had of late!\nAmazing cauliflower to start and a awesome main course.\nLocal cider and a strange take on an  Espresso Martini!\nWould definitely return. Great food with plenty of options and delicious flavours. Massaman curry, beef pho noodles, duck rolls, even tofu popcorn - all excellent.\nThoroughly recommended. This place doesnt look very appealing from the outside, however the food was good. The service was exceptional. Great choice of drinks including wines. The food was great! Cant commend it high enough. It came out incredibly fast and it was delicious all around. The interior is gorgeous and offers a sharp juxtaposition of the entrance where the seats are darker and more intimate versus in the middle of the restaurant where there is a huge skylight and everything is bright and more family oriented with benches instead of booths and tables. The food was delicious and the cocktails were okay, they took longer than the food to arrive but thats a very minor thing. The hostess was very helpful and kind and managed to find us a seat even though we didnt book. We also wanted to order dessert as we got the dessert menu but unfortunately the staff took about 20 minutes to come back to us to take the order at which point we had already lost appetite. Overall it was good food and a good experience but the staff were a bit slow and the prices a tad too high for what it should be. Otherwise an okay restaurant New Years Eve. Table booked for 6. Order wasnt taken until 630. Drinks arrived at 645. Offered a free drink. Main courses arrived. No starter and one wrong main. Husbands meal was finished by the time mine arrived. Usually great service but really disappointed on this occasion. Service is normally excellent this was why we were left so disappointed."
    },
    {
      "types": [
        "italian_restaurant",
        "mediterranean_restaurant",
        "fine_dining_restaurant",
        "wine_bar",
        "steak_house",
        "vegan_restaurant",
        "pizza_restaurant",
        "vegetarian_restaurant",
        "seafood_restaurant",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "12 Fownes St Upper, Temple Bar, Dublin 2, D02 PY51, Ireland",
      "displayName": {
        "text": "La Caverna Restaurant and Wine Bar",
        "languageCode": "en"
      },
      "reviews": "I chose this restaurant as I'd read online recommendations for vegetarians. It has a fantastic choice of vegan dishes alongside non-vegan options. I went for the vegan lasagne. It was delicious and very generous portions. The service was friendly and very attentive. Would definitely recommend. Lovely Italian (vibe) restaurant right in temple bar. The prawn starter really wowed me, the main was ok, the beef was slightly chewy and a bit too oil for my taste. Had a toffee pudding for dessert and it was again just ok.\n\nThe service was very good, but they came to ask if everything is ok too many times which made them come off as trying way too hard.\n\nThe price was very reasonable given its right in the city centre, but I dont agree with charging 12% service charge, and asking people to pay in cash if possible due to terminal fees.\n Its no doubt a lovely restaurant, but those little things didnt sit well with me. Had our Xmas party in this restaurant last night for 23 people, the staff were very helpful even under so much pressure,  the service was excellent. The food arrived fairly quickly, and I had easily one of the nicest steak I've had. The other guests all loved their food. Excellent night all round, special thanks to david and Isa for their service all night, greatly appreciated. Absolutely fantastic experience! The mussels were amazing, the lasagna was delicious, and the attention to detail in both the food and service was incredible. Worth every penny Its nice place. We had a team event here. The staff are very friendly and service is quick. The food though is about ok, not impressive at all just ok. The steak was chewy , chicken wings were too dry, pastas were good. I dont recommend for tasty dining. The food level is ok for a cheaper restaurant but this one is not cheap so not super impressed overall"
    },
    {
      "types": [
        "wine_bar",
        "liquor_store",
        "bar",
        "food",
        "store",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "29 Drury St, Dublin, D02 RX95, Ireland",
      "displayName": {
        "text": "Loose Canon Cheese and Wine",
        "languageCode": "en"
      },
      "reviews": "A really fun concept that is executed well. Great food and nice wine!\n\nThe place is very small, so not good for groups of 4 or more. There is outside seating though. Toasties are great, the one with chorizo is spicy so be careful! The cheese toast was okay. I love the design of wine glasses its worth taking a picture with it. But the service wasnt good enough. When we entered the store there were 2 staff doing nothing and they completely ignored us even not saying hello or hi. Ive been to this store 2 times and it happened every single time. I love the atmosphere of this store but Im not gonna visit again. This little place was a great surprise! Staff were quick and friendly- Mark helped me choose my wine. Great selection of cheeses etc. we enjoyed a cheese and meat plate with our wine. There were plenty of customers but still room to relax. Thanks guys! Original, toast was great for a small lunch.\n\nIngredients are very fresh and tasted delightful.\n\nOne thing id change, is there aren't any other options for non pork eaters as the toasts are pre-made so (can't remove or modify) the pork. Adding one more item to accommodate this would be fantastic This is a place with great potential but some things were off during our visit.\nThe wine variety by the bottle is big but we were missing some more rose/orange options by the glass.\nThe cheese toastie was sold out, we tried the harissa but felt which was tasty but the cheese was not completely melted. We also got a single cheese with bread, both tasty but we got enough bread but only three small pieces of cheese.\nSecond round of wines was served it steaming hot glasses but the wine was cold and overall the staff felt a bit inattentive.\nThe place is small but many people grab the wine and stand outside, the road has definitely nice vibes."
    },
    {
      "types": [
        "pizza_restaurant",
        "wine_bar",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "42 Drury St, Dublin, D02 T210, Ireland",
      "displayName": {
        "text": "MANI",
        "languageCode": "en"
      },
      "reviews": "Excellent location and good variety of pizza slices available at Manis. When the sun is out this place is buzzing with people all around and it takes a long time for your buzzer to beep for the order. Taste is good and flavoursome, would definitely go there to try more of their options on the menu. Getting place to sit on a busy weekend is not for the faint hearted, but its just as good it eating in takeout nearby. Another hidden gem. Theres loads of pizza places in Dublin. However this one is one of the best Ive tried. Ruby greeted me snd made me feel welcome. I ordered the carbonara slice . Beyond good. Will I be back ? Most definitely. The staff here were incredibly friendly and patient, answering all my questions with a smile. The pizza bread was delicious crispy with generous fillings. I ordered the slow-cooked pork and sliced potato panini, which was a bit heavy for my taste, but still enjoyable. On the other hand, the mushroom and ham pizza was excellent! Pizza was very tasty , I tried their new Christmas slice.  Good balance of flavours I'm a sucker for festive food, would have liked a bit more cheese / sauce as it was a tad dry, but the side gravy helped a lot with that. 8.50 is very expensive but that's Dublin. Loved the pizza, soft base yet a bit crunchy, you will enjoy it from the first bite.\n\nRecommended Pepperoni, Sausage and mushrooms pizza\n\nBest Pizza in Dublin 2nd place  /10"
    },
    {
      "types": [
        "wine_bar",
        "spanish_restaurant",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "12 Eustace St, Temple Bar, Dublin 2, D02 VY27, Ireland",
      "displayName": {
        "text": "The Port House Pintxo",
        "languageCode": "en"
      },
      "reviews": "Under rated! Very tasty and great service.. the light was a little dark to see the food and from what i did see they would probably do well with some extra garnishes on the meals but everything tasted amazing. Very disappointing place.\n\nWe entered as 4 trying to get a drink and charge our phone due to needing it to book our hotel next door. The man taking us in rolled his eyes while leaving our phone on the counter instead of charging it for about 5 minutes until we noticed.\n\nWe ordered a Port wine which took about 2 minutes in conversation to be understood. We required pointing at the menu, presumably the waitress didn't know what type of wines she had.\n\nThe irish coffee we got served was disgusting even after adding sugar to it.\n\nWe got repeatedly asked if we were ready to order food after stating we're there for drinks from the beginning and again after.\n\nNot only this i witnessed the waiter running the food rubbing his hair with his hands and on his shirt without sanitizing them whatsoever during my 20 minute stay.\n\nThe irish coffee remained barely touched.\n\nWould avoid going, terrible service. Can't blame the kitchen since we'd never get that far. A charming, romantic place, perfect for an evening for two or with close friends! The atmosphere is warm, pleasant, the people who served us are particularly nice and the tapas delicious. We felt very good, congratulations for everything you do! Amazing variety of tapas dishes to meet all sorts of requirements. The dishes were all freshly made and really flavourful. Great hospitality from the staffs and the service was prompt. Some of my favourites were the Croquetas, duck leg, green peppers! There is still a variety of dishes I have yet to try but my 1st experience has been amazing and I would definitely return. Ive added a copy of the Menu for anyone who wishes to have a browse.\nA must try tapas place in Dublin. the dishes are not worth their prices, much too expensive for what we ate, to tell you that at the end we were still very hungry, much too salty for my taste. I put two stars, because there is little quantity."
    },
    {
      "types": [
        "wine_bar",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "18 Merrion Row, Dublin, D02 A316, Ireland",
      "displayName": {
        "text": "Etto",
        "languageCode": "en"
      },
      "reviews": "This is the second time wed been back to Etto and I would definitely recommend! The food is really good and very reasonably priced. I also like that the menu is slightly different with dishes I havent tried before. The prunes dessert are a must! Excellent restaurant in Dublin center, must book in advance as it is small and might not have availability.\n Chefs menu was very good, at good price. Same with wines.\nThey deserve 5 stars, but the restaurant was extremely noise, I cannot even hear my friend who was sitting in front of me! Too much noise. This place is fantastic. My girlfriend and I have spent the last week and a half in London, Edinburgh, and Dublin and this was BY FAR the best meal of our trip. I highly recommend Simply delicious food and the presentation is amazing. Go try it and I guarantee you will not regret it. It's a gem of a restaurant not to be missed. The portion sizes are just about right, even though they are on the pricey side, it's well  worth it. The staff is amazing, super friendly and super helpful, paying attention to small things too. It's a small place and be prepared to squeeze past each other and the wine boxes there, that part needs improvement. Although they do have quite a big selection of wine. Booked a reservation after doing some research and reviews. Extremely small space with tables very close together. A bit annoying that they make you purchase 3 dishes each at dinner. Portions are small and the food a bit pricey, but presentation was beautiful & the food was excellent. Best vegetarian dish I have had in awhile. Very good and prompt service. For a restaurant that is charging as much as it is, would expect them to have wifi. Overall, would come again as the food was very good, but missed 5/5 based on the above."
    },
    {
      "types": [
        "restaurant",
        "wine_bar",
        "bar",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "101 Setanta Pl, Dublin 2, D02 W3Y7, Ireland",
      "displayName": {
        "text": "Library Street Restaurant",
        "languageCode": "en"
      },
      "reviews": "Hidden gem! Airy, unique interior and the quality of cooking is fantastic. Bill took a little big long to arrive and overall atmosphere was on the less buzzy side, however it can be forgiven for the quality of food. Go if you're in the mood for high quality, modern food. I recently dined in Library Street end of November for a very special occasion. My fianc and I had got engaged in St Stephens green very shortly before we ate and we couldnt have picked a better restaurant to celebrate. Anne Marie couldnt have been more welcoming and really helped make it a fantastic occasion. The service from all the team was superb, and the menu was really exceptional. We loved every dish but our absolute stand out dishes were the Kimchi canbage (we ordered two!), pear salad and the venison en croute. The cocktails were also delicious. Really well done to Kevin and his kitchen.\n\nThe restaurant has a fabulous atmosphere which is absolutely driven by the staff who engage so well with their guests.\n\nHaving read strong reviews about Library street in the Irish times and else where it truly lives up to its reputation. A terrific endorsement for the Irish culinary scene and I absolutely look forward to coming back again.\n\nA very special thank you to all Kevin, Anne Marie and all at library street x Great experience here. Restaurant is small but comfortable. Food was excellent and staff was very friendly. Unique and creative dishes with traditional Irish ingredients. I loved the restaure. Super layback with friendly staff and amazing food. Simple and taste. The way it should be.\nThe cabbage is a WOW We recently had an amazing dining experience at Library Street restaurant.\nThe staff was friendly and attentive, creating a welcoming atmosphere.\n\nThe menu offered a wide variety of delicious options, and I was blown away by the flavors and presentation of the dishes.\nThe quality of the ingredients and the chef's attention to detail were impressive.\nThe portion sizes were generous, and I left feeling completely satisfied.\nThe service was impeccable, with knowledgeable waitstaff providing excellent recommendations.\n\nOverall, it was an outstanding experience with absolutely delicious food, a cozy ambiance, and exceptional service.\nI highly recommend this restaurant to anyone looking for a delightful culinary adventure.\n\nDefinitely coming back"
    },
    {
      "types": [
        "italian_restaurant",
        "wine_bar",
        "cafe",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "13A Bachelors Walk, North City, Dublin, D01 VN82, Ireland",
      "displayName": {
        "text": "Terra Madre",
        "languageCode": "en"
      },
      "reviews": "Heard great things about this place online but did not live up to the expectations. Food was decent and service quality was poor. I feel like the food wouldve tasted better if the server didnt put such a bad taste in my mouth. Having dinner in Terra Madre is like dining in Nonna's kitchen. The food is perfectly cooked traditional Italian. We shared the charcuterie board and delicious fresh, milky burrata to start, with great bread.\nClean plates were a great sign that we loved the wild boar stew, fettuccine with truffle, and the gnocchi.\nIt's a small basement space with mismatched chairs and perfectly charming. I'll be back. Brilliant little authentic Italian place. Head waiter is lovely and talked us through all of our dishes. Everything cooked to perfection. The pasta was to die for and the desserts were gorgeous. Definitely recommend! the best pasta that Ive ever had! soooo good!! and the service was amazing as well, they come to check if the food is good, put more water, to see if we need something and also they are very kind! I really recommend this place! First time here after wanting to come for ages. Got the Bresaola starter with parmesan celery and lemon great flavours in a small bite and very refreshing. For mains: Tagliatelle Amatriciana, Ravioli with Porcini mushroom filling in a cream sauce, Wild boar stew. Great texture on the pastas, and sauces not too rich. Wild boar stew was hearty, meat was dry but flavour was alright, fantastic side of toasted bread. Complimentary bread with a fine olive oil. Overall: Cooking very home-style as opposed to fine dining, good only if authenticity is what you crave. Intimate dining space either come early or book early. Great service. Servings are small considering prices, but if ingredients were imported then I suppose this is justified. Unique experience but for me personally am not particularly inclined to come back."
    },
    {
      "types": [
        "wine_bar",
        "bar",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "Row , Coppinger Row Unit , City Assembly House, Dublin 2, Ireland",
      "displayName": {
        "text": "Row Wines",
        "languageCode": "en"
      },
      "reviews": "This was a great bar with interesting tapas, cool vibe and music. The service was great, the plates were really tasty and the combinations were unexpected but so good. Our favorite were the duck and the oysters - least favorite was the crab ( lacking seasonings or acidity)x\nThe overall atmosphere had an amazing party vibe and the design was elegant and a bit retro.\nLoved it and definitely recommend for a night out, not your typical restaurant. Dont forget to book your tables in advance especially if you are aiming for the weekend. My wife & I were invited by a friend to dine here on New Years eve. It was an outstanding experience. The food was exemplary. Everything was carefully balanced, the flavours and textures were amazing. Carefully thought out combinations, perfectly cooked and presented, through out. Rarely have I dined anywhere were the staff were so on-point. Without once being intrusive, they made sure we wanted for nothing and no glass ran dry! In truth I cannot praise Row highly enough. It's not particularly cheap but great value for what you are getting. In honesty I think they could well deserve a Michelin Star. Well done! I ran out of words to express how delightful it was to celebrate my birthday at Row Wines. The service was impeccable, and the food was beyond exceptional. We were well looked after by Stevie, Adam, Pete, and the legend Billie, who brought the coolest vinyl tunes for the evening.\n\nA big shoutout to all the magic hands behind the kitchen10/10 \n A memorable experience for sure. Owner of another local restaurant gave us the recommendation and we are so glad. The vibe alone is worth coming. You know when you roll up to a place and its so cool you dont think you are cool enough to step a foot in? Thats this place but you are welcomed with smiles and a buzzing sound of everyone having an amazing time. The Dj spinning ACTUAL vinyls while he is drinking wine and enjoying it just as much as you are, adds the aesthetic exponentially. I havent even talked about the food!! The drinks were the right amount of unique, my husband had the EVOO martini and I had the raisin Negroni. Both wonderful flavors. THE CARBONARA CROQUETTES. My word. Ill dream about those, because their menu is ever changing, Ill only ever have it again in my dreams. The sauce I could bathe in the pancetta crispies!! Then the mushroom flatbread so so good I was eating so fast I bit my lip lol. And the stuffed jalepeno deviled egg was unexpectedly delicious. Will definitely return when in Dublin again. Hip and happening wine bar with fab smalll bites. Crab and cheese plate a must. A friendly and welcoming team are great guides of a well curated wine list which has selection without being over-bearing. Tables are for two hours and it was a busy Friday evening so just be aware it gets busy. A heated on street terrace is available. We were inside and athmosphere was buzzing and fun."
    },
    {
      "types": [
        "wine_bar",
        "pub",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "1-2 Chancery Pl, Inns Quay, Dublin 1, D07 HP40, Ireland",
      "displayName": {
        "text": "The Legal Eagle",
        "languageCode": "en"
      },
      "reviews": "Very nicely decorated and preserved restaurant which has a cozy flair to it.\nThe staff is extremely friendly and accommodating. The Sunday Roast was good but the potatoes were a bit dry and the meat a bit too done. But we still enjoyed ourselves very much Lovely cosy little pub. Visited for a Sunday roast and the food was delicious, service was great and staff were super friendly and welcoming. The pork belly was so tasty with the best crackling! They dished out a cake for my birthday and we all had a lovely time! One of the best roasts we have ever had. Staff were very attentive and gave some great recommendations for things to do in Dublin.\n\nTwo glasses of malbec and two roasts came to about 75 inc. service charge.\n Super handy location for anyone staying or visiting the city centre.\n Would highly recommend. Went for Sunday lunch and got the roast pork belly. My plate was stacked - the pork skin had to be cut off and enjoyed separately it was so good and everything else was delicious, but the roast potatoes could use a little work. Perfect way to get you through a Sunday with great atmosphere, lovely staff, and a good drinks selection. Definitely book as it gets busy. Really great atmosphere for a drink. But the food was only okay, especially for the price point. I wouldnt come back for it, by any means. The staff were so hard to get attention from, didnt check in on us and could barely even get them to pay.\n The spicy margarita wasnt spicy so if you want a regular margarita order the spicy, its 20 cheaper. The cherry blossom was GORGEOUS. So was the Belfast coffee. The Go Figure was nail polish remover - steer clear."
    },
    {
      "types": [
        "italian_restaurant",
        "wine_bar",
        "pizza_restaurant",
        "meal_takeaway",
        "seafood_restaurant",
        "bar",
        "food_store",
        "restaurant",
        "food",
        "store",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "Meeting House Square, Temple Bar, Dublin 2, Ireland",
      "displayName": {
        "text": "Al Vesuvio",
        "languageCode": "en"
      },
      "reviews": "I recently had the pleasure of dining at this amazing Italian restaurant, and I must say, it was an unforgettable experience. The food was absolutely delicious authentic, fresh, and full of rich flavors. Every dish was prepared with great attention to detail, from the perfectly cooked pasta to the mouthwatering desserts.\n\nWhat made the experience even better was the incredible service. The waiters were not only professional but also exceptionally friendly and attentive. They went out of their way to ensure we had everything we needed, making us feel truly welcome. Their passion for hospitality and genuine enthusiasm made the evening even more enjoyable.\n\nIf youre looking for a place with top-notch Italian cuisine and warm, dedicated service, this is definitely the place to go. Highly recommended! Pizza has absolutely amazing flavor, but quickly gets soggy in the middle. We ordered a pizza with spinach and Italian sausage. The rigatoni al normal was absolutely delicious. 10/10 for pasta. Simple pizza is better for sure. Service was quick. We did order desert, creme brule and a glass of wine. I had a fantastic dining experience at Al Vesuvio in Dublin. The service and food were both exceptional, truly capturing the essence of Italian cuisine. The ambiance made me feel like I was dining in Italy, adding to the authenticity of the experience. On top of that, the prices are very fair, making it a great value for the quality you receive. I highly recommend Al Vesuvio for anyone looking to enjoy a genuine Italian meal in Dublin. Great food and ambience. All the staff were amazing, very friendly and so patient. We were made to feel so welcome despite arriving late for our booking. Definitely recommend for a group night out. Well be back soon but on time. Went here for a birthday with my girlfriend, we got pasta dishes and shared a bottle of wine. Situated in an old wine cellar, Al Vesuvio was a very neat atmosphere especially with the pizza oven right there in the back. Great food, wine, and reasonably priced. No wait for a table.\n\nThere was a small child running around screaming, which echoed around the vaulted ceiling. Detracted from the experience somewhat, but its a kid so you cant really complain ya know? Lovely spot."
    },
    {
      "types": [
        "italian_restaurant",
        "wine_bar",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "14 Fenian St, Dublin, D02 V596, Ireland",
      "displayName": {
        "text": "L'Enoteca di Napoli",
        "languageCode": "en"
      },
      "reviews": "True Italian food with a high standard of service. A number of sharing platters, one of which is an exceptional cheese board. Supurb Italian wine selection. Good option pre Gaiety theatre. I had a lovely dinner with friends here. The food is honestly good. I had the pizza but some other friends took risotto and pasta and they looked great too! What I liked the most is that the kitchen and the oven are open, so you can see and enjoy the cooking process. The staff is polite. The place itself is very cozy and the atmosphere is authentic. Prices in line with Dublin standard for an Italian restaurant. I'll come back for sure! Authentic Italian food, nice staff and great atmosphere. Pretty small so you need to book in advance but really Recommended! Very authentic and tasty menu. We had to run off to a show but I wished we could have tried more courses. Everything was clearly labeled for dietary restrictions. It was good value as well. Its a good place to get real Italian food when in Dublin! visiting for lunch with coworkers. The setting is lovely and well decorated, with gracious and welcoming service. I wasn't completely satisfied with the food, especially the pizza because the crust wasn't cooked through enough. The aubergine parmigiana, however, was a success. The pasta was ok. Prices were likely slightly above average."
    },
    {
      "types": [
        "italian_restaurant",
        "wine_bar",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "formattedAddress": "47 Nassau St, Dublin, D02 P285, Ireland",
      "displayName": {
        "text": "Aperitivo",
        "languageCode": "en"
      },
      "reviews": "The food and drinks were all amazing, the atmosphere was nice although the restaurant is incredibly small.\n I can't help but leave a negative review because they made me pay an extra 10.45 service charge which screwed up my night!! It says on the receipt that it's optional, but when I asked the waitress (Sofia) if I have to pay it, she said that it's a charge for \"carrying our food to the table\" which is like 2 steps away.\nNow don't get me wrong, I wouldn't mind tipping that much or even more, but it didn't feel optional at all!! If anything, it was utterly disgusting of them not to explain that beforehand. Lovely Italian tapas style restaurant with a nice atmosphere. The food was delicious, we shared small plates of pastas and some fried foods. The restaurant was quite small so would recommend booking a table. Recommended... this is a tapas place, so everything is on a tapas size... many plates to order to fill yourself.  Wine and cocktails list was extensive too. First time going. Ordered 3 dishes each which was just enough. My favourite was definitely the burrata and the cacio e pepe! Also ordered a Hugo spritz which was lovely and sweet.\n Staff very welcoming and attentive. Compliments to Chef Nino. Wholly recommend :) Love this place. Second time here. We had the bolognese and fontina cheese arancini as a starter,   and I had the porcini mushroom pasta as my main . My husband had the Norma pasta and my daughter had the lasagne. Everything was well prepared. The arancini are particularly good. Fairly pricey wine but good quality."
    }
  ]
}